# Дан список, упорядоченный по неубыванию элементов в нем. Определите, сколько в нем различных элементов.

l = list(input().split())
s = set(l)
print(len(s))
